//Use an array to hold the value of the quotes
var arrayOfQuotes = [
    {
        'author': 'ابو الطيب المتنبي',
        'quote': 'ذو العَقلِ يَشقى في النَعيمِ بِعَقلِهِ وَأَخو الجَهالَةِ في الشَقاوَةِ يَنعَمُ',
    },

    {

        'author': 'ابو الطيب المتنبي',
        'quote': 'وَلَم أَرَ في عُيوبِ الناسِ شَيئاً كَنَقصِ القادِرينَ عَلى التَمامِ'
    },

    {
        'author': ' ابو الطيب المتنبي',
        'quote': ' ما أَبعَدَ العَيبَ وَالنُقصانَ عَن شَرَفي أَنا الثُرَيّا وَذانِ الشَيبُ وَالهَرَمُ  '
    },

    {
        'author': ' ابو الطيب المتنبي ',
        'quote': ' وَإِذا أَتَتكَ مَذَمَّتي مِن ناقِصٍ فَهِيَ الشَهادَةُ لي بِأَنِّيَ كامِلُ'
    },

    {
        'author': 'أبو العلاء المعري ',
        'quote': '  تَعَبُ كُلّها الحَياةُ فَما أعْـجَبُ إلاّ مِنْ راغبٍ في ازْديادِ  '
    },

    {
        'author': 'أبو العلاء المعري ',
        'quote': ' وَيَنشَأُ ناشِئُ الفِتيانِ مِنّا عَلى ما كانَ عَوَّدَهُ أَبوهُ  '
    },
    {
        'author': ' عنتره ابن شداد',
        'quote': ' وَإِذا بُليتَ بِظالِمٍ كُن ظالِم وَإِذا لَقيتَ ذَوي الجَهالَةِ فَاِجهَلي '
    },

    {
        'author': 'أبو تمام ',
        'quote': '  نَقِّل فُؤادَكَ حَيثُ شِئتَ مِنَ الهَوى ما الحُبُّ إِلّا لِلحَبيبِ الأَوَّلِ '
    },

    {
        'author': 'ابو نواس',
        'quote': '  يا رَبِّ إِن عَظُمَت ذُنوبي كَثرَةً فَلَقَد عَلِمتُ بِأَنَّ عَفوَكَ أَعظَمُ'
    },
    {
        'author': 'ابو نواس ',
        'quote': '  دَع عَنكَ لَومي فَإِنَّ اللَومَ إِغراءُ وَداوِني بِالَّتي كانَت هِيَ الداءُ '
    },
    {
        'author': 'ابو نواس ',
        'quote': '  فَقُل لِمَن يَدَّعي في العِلمِ فَلسَفَةً حَفِظتَ شَيئاً وَغابَت عَنكَ أَشياءُ '
    },
    {
        'author': 'احمد شوقي ',
        'quote': '  وَما نَيلُ المَطالِبِ بِالتَمَنّي وَلَكِن تُؤخَذُ الدُنيا غِلابا'
    },
    {
        'author': ' ابو العتاهية ',
        'quote': '  خالِف هَواكَ إِذا دَعاكَ لِرَيبَةٍ فَلَرُبَّ خَيرٍ في مُخالَفَةِ الهَوى'
    },
    {
        'author': ' عَرقَلة الكلبي ',
        'quote': '  لا تعجبَنَّ لِقِصري عندَ طولِهِمُ فالفخرُ لِلَّيثِ، ليس الفخرُ للجَملِ  '
    },
    {
        'author': '  ضيدان مالي ',
        'quote': '   مالي أرى الأبوابَ لا تهواني  ومن أحبُّ لا يُحبُّ يراني  '
    },
    {
        'author': '  فان جوخ ',
        'quote': '  ما فائدة الحياة، إذا لم يكن لدينا الشجاعة لتجربة كل شيء  '
    },
    {
        'author': '  تشارلز بوكوفسكي ',
        'quote': '  لن تحصُل على حرّيتك إلاَّ حين تستقِلُّ ماديًّا، وما عَدا ذلِك كلَّهَا فلسفة وأفكَار خياليَّة '
    },
    {
        'author': '  حسن المرواني',
        'quote': '  لو لم يكُن أجمل الألوانِ أزرقها ما اختاره الله لونًا للسماواتِ  '
    },
    {
        'author': ' ابو تمام ',
        'quote': '    بَصُرتَ بِالراحَةِ الكُبرى فَلَم تَرَها  تُنالُ إِلّا عَلى جِسرٍ مِنَ التَعَبِ '
    },
    {
        'author': ' ابو الطيب ',
        'quote': '  وَإِذا كانَتِ النُفوسُ كِباراً تَعِبَت في مُرادِها الأَجسامُ   '
    },
    {
        'author': ' ستيف هارفي  ',
        'quote': '  الأعذار تجعل اليوم سهل وغدًا صعب.. الانضباط يجعل اليوم صعب وغدًا أسهل  '
    },
    {
        'author': ' ابو فراس الحمداني ',
        'quote': ' وما أخوكَ الذي يدنو بهِ نسَبٌ لكنْ أخوكَ الذي تصفو ضمائرهُ  '
    },
    {
        'author': ' بشار بن برد ',
        'quote': ' ولابُدَّ من شَكْوَى إِلى ذي مُروءَةٍ يُوَاسِيكَ أَوْ يُسْلِيكَ أو يَتَوَجَّع '
    },
    {
        'author': ' ابو فراس الحمداني ',
        'quote': ' تَهونُ عَلَينا في المَعالي نُفوسُنا وَمَن خَطَبَ الحَسناءَ لَم يُغلِها المَهرُ'
    },
    {
        'author': ' ابو فراس الحمداني ',
        'quote': '  سَيَذكُرُني قَومي إِذا جَدَّ جِدُّهُم وَفي اللَيلَةِ الظَلماءِ يُفتَقَدُ البَدرُ '
    },
    {
        'author': 'بشار ابن برد',
        'quote': '  إِذا كُنتَ في كُلِّ الذُنوبِ مُعاتِباً صَديقَكَ لَم تَلقَ الَّذي لا تُعاتِبُه'
    },
    {
        'author': ' ابو فراس الحمداني  ',
        'quote': '  وَنَحنُ أُناسٌ لا تَوَسُّطَ عِندَنا لنا الصّدرُ دونَ العالَمينَ أوِ القَبرُ  '
    },
    {
        'author': ' ابو فراس الحمداني   ',
        'quote': ' أَعَزُّ بَني الدُّنيا وأعلىٰ ذَوي العُلا وَأكرَمُ مَن فَوقَ التُّرابِ ولا فَخرُ '
    },

    {
        'author': 'حوط بن رئاب الأسدي',
        'quote': ' لا تحسَبِ المجدَ تمرًا أنتَ آكلُه لن تبلغَ المجد حتى تلعَق الصَّبِرا '
    },
    {
        'author': ' المتنبي ',
        'quote': ' إذا غامرتَ في شرفٍ مَرومِ ... فلا تقنعْ بما دون النجـــــومِ'
    },



];



var arrayofimg = [

];







// function generateQuote() {
//     var random = Number.parseInt(Math.random() * arrayOfQuotes.length + 1);
//     document.querySelector('#quoteOutput').textContent = `\"${arrayOfQuotes[random].quote}\"`;
//     document.querySelector('#authorOutput').textContent = `--${arrayOfQuotes[random].author}`;

// }

var usedIndices = [];

function generateQuote() {
    var randomIndex;
    do {
        randomIndex = Number.parseInt(Math.random() * arrayOfQuotes.length);
    } while (usedIndices.includes(randomIndex));

    usedIndices.push(randomIndex);

    document.querySelector('#quoteOutput').textContent = `"${arrayOfQuotes[randomIndex].quote}"`;
    document.querySelector('#authorOutput').textContent = `--${arrayOfQuotes[randomIndex].author}`;

    // Reset the `usedIndices` array when all quotes have been used
    if (usedIndices.length === arrayOfQuotes.length) {
        usedIndices = [];
    }
}